tap "krishkrosh/apps"

# Core CLI
brew "bat"
brew "bat-extras"
brew "coreutils"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "lazygit"
brew "ripgrep"
brew "starship"
brew "tldr"
brew "zoxide"

# Shell
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Editors
brew "neovim", args: ["HEAD"]

# Terminal multiplexer
brew "tmux"
brew "tpm"

# Dev tooling
brew "fnm"
brew "pnpm"
brew "rustup"
brew "cmake"

# Media & documents
brew "chafa"
brew "fastfetch"
brew "ffmpeg-full"
brew "imagemagick"
brew "resvg"
brew "tectonic"
brew "woff2"
brew "yazi"

# Security
brew "gnupg"
brew "pinentry-mac"

# AI
brew "opencode"

# Services
brew "syncthing"

# Fun
brew "cowsay"

# Casks
cask "ayugram"
cask "bitwarden"
cask "canva"
cask "chatgpt"
cask "emacs-app"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "karabiner-elements"
cask "kitty"
cask "obs"
cask "obsidian"
cask "raycast"
cask "steam"
cask "telegram"
cask "wezterm"
cask "zen"
